ttkpark/safelink/test_gpio_blink/sdkconfig.defaults
# ESP32-C6 GPIO Blink Test Configuration

# Target Configuration
CONFIG_IDF_TARGET="esp32c6"

# GPIO Configuration
CONFIG_GPIO_ESP32C6_SUPPORT_SWITCH_SLP_PULL=y

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000

# Log Configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Main task stack size
CONFIG_MAIN_TASK_STACK_SIZE=4096

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y 